sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
/*
 * Called by main when mainCREATE_SIMPLE_BLINKY_DEMO_ONLY is set to 1 in
 * main.c.
 */
void main_blinky( void );
void can_tx_next_packet(BaseType_t *ptask_woken);
void handle_csp_tlm_request(csp_conn_t * conn, csp_packet_t * packet);
void handle_csp_timesync(csp_conn_t * conn, csp_packet_t * packet);
int  csp_reboot_function(void);
void can_start_tx(void);

/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask( void *pvParameters );
static void prvClockTask( void *pvParameters );
static void prvCanTask( void *pvParameters );
static void prvMissionTask( void *pvParameters );
static void prvI2CServiceTask( void *pvParameters );
static void prvInitRegMap( void );
static uint8_t prvSampleRpHeartbeat( void );
static void prvI2cBusRecovery( void );

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;
static QueueHandle_t xCanQueue = NULL;
static SemaphoreHandle_t xRegMapMutex = NULL;
static rp2350_regmap_t xRpRegMap;
static uint16_t xI2cFaultCount = 0;
static uint16_t xI2cRecoveryLevel = 0;

struct AppMessage ADCResult = {0};
struct AppMessage CANflag = {0};

uint32_t rid;
uint32_t ridbuf[4];
uint8_t nirq = 0;
uint8_t mext;
uint8_t eflag;
uint8_t irq, buf[8];
uint16_t ADCdata[16];
uint32_t ADCtime;
uint8_t wakecount = 0;
uint8_t errorcount = 0;
#pragma NOINIT(bootCount)
uint16_t bootCount;
#pragma NOINIT(bootCause)
uint16_t bootCause;
uint32_t uptime= 0;
uint32_t wd_timeout = 86400;
#pragma NOINIT(wd_count)
uint16_t wd_count;
uint16_t rx_csp = 0;
uint16_t tx_csp = 0;


#define DEFAULT_TLM_PERIOD (30)

uint32_t tlm_period = DEFAULT_TLM_PERIOD;
uint32_t tlm_duration = 0;
uint32_t tlm_counter = 0;

volatile uint32_t wdt1_pulse_period_s = WDT_PULSE_PERIOD_DEFAULT_S;
volatile uint32_t wdt2_pulse_period_s = WDT_PULSE_PERIOD_DEFAULT_S;

csp_iface_t * default_interface = NULL;
csp_conn_t *conn = NULL;

uint8_t tlm_pkt[MAX_TLM_PACKET_SIZE] = {0,};

#pragma NOINIT(current_second)
uint32_t current_second;

/* This is the hardware-specific reboot function that is registered with the CSP library, and called on csp_reboot(). */
int csp_reboot_function(void)
{
    /* trigger a brown-out reset, this is equivalent to a initial power-up reset, and completely resets the MSP430.  */
    PMM_trigBOR();

    /* shouldn't get here */
    return CSP_ERR_NONE;
}


void main_blinky( void )
{
    int error;

    bootCause = SYSRSTIV;

    if (bootCause <= SYSRSTIV_DOBOR)
    {
        /* power on reset, NMI(JTAG) reset or commanded (do BOR) reset - clear wd_count */
        wd_count = 0;

        if (bootCause <= SYSRSTIV_RSTNMI)
        {
            /* reset time */
            current_second = 0;
        }
    }

    ++bootCount;

    csp_sys_set_reboot(csp_reboot_function);

    error = csp_can_socketcan_open_and_add_interface("/dev/can", CSP_IF_CAN_DEFAULT_NAME, 0, false, &default_interface);
    if(error != CSP_ERR_NONE) {
        /* complain! */
        //csp_print("Error %d opening CAN interface", error);
    }

    csp_rtable_set(0, 0, default_interface, CSP_NO_VIA_ADDRESS);

	/* Create the queue. */
    xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( struct AppMessage ) );
    xCanQueue = xQueueCreate( 8, sizeof( struct AppMessage ) );
    xRegMapMutex = xSemaphoreCreateMutex();
    prvInitRegMap();

	if( ( xQueue != NULL ) && ( xRegMapMutex != NULL ) )
	{
        /* Start the tasks. */
	    csp_route_start_task(configMINIMAL_STACK_SIZE, mainQUEUE_RECEIVE_TASK_PRIORITY+1);

		xTaskCreate( prvQueueReceiveTask,				/* The function that implements the task. */
					"Rx", 								/* The text name assigned to the task - for debug only as it is not used by the kernel. */
					configMINIMAL_STACK_SIZE, 			/* The size of the stack to allocate to the task. */
					NULL, 								/* The parameter passed to the task - not used in this case. */
					mainQUEUE_RECEIVE_TASK_PRIORITY, 	/* The priority assigned to the task. */
					NULL );								/* The task handle is not required, so NULL is passed. */

		xTaskCreate( prvClockTask, "CLK", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_RECEIVE_TASK_PRIORITY+1, NULL );

        xTaskCreate( prvCanTask, "CN", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_RECEIVE_TASK_PRIORITY+2, NULL ); // highest priority

        xTaskCreate( prvMissionTask, "MIS", configMINIMAL_STACK_SIZE, NULL, mainMISSION_TASK_PRIORITY, NULL );

        xTaskCreate( prvI2CServiceTask, "I2C", configMINIMAL_STACK_SIZE, NULL, mainI2C_TASK_PRIORITY, NULL );

		/* Start the tasks and timer running. */
		vTaskStartScheduler();
	}

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created.  See the memory management section on the
	FreeRTOS web site for more details on the FreeRTOS heap
	http://www.freertos.org/a00111.html. */
	for( ;; );
}
/*-----------------------------------------------------------*/

static void prvInitRegMap( void )
{
    memset( &xRpRegMap, 0, sizeof( xRpRegMap ) );
    xRpRegMap.status = REG_STATUS_MSP_ALIVE | REG_STATUS_I2C_LINK_OK;
    xRpRegMap.wdt1_period_s = ( uint16_t ) wdt1_pulse_period_s;
    xRpRegMap.wdt2_period_s = ( uint16_t ) wdt2_pulse_period_s;
}

static uint8_t prvSampleRpHeartbeat( void )
{
    return ( uint8_t ) GPIO_getInputPinValue( GPIO_PORT_P3, GPIO_PIN1 );
}

static void prvI2cBusRecovery( void )
{
    /* Placeholder recovery rung: reinitialize I2C peripheral in future integration step. */
}

static void prvMissionTask( void *pvParameters )
{
    TickType_t xNextWakeTime;

    ( void ) pvParameters;
    xNextWakeTime = xTaskGetTickCount();

    for( ;; )
    {
        vTaskDelayUntil( &xNextWakeTime, mainMISSION_TASK_FREQUENCY_MS );

        if( xSemaphoreTake( xRegMapMutex, pdMS_TO_TICKS( 5 ) ) == pdPASS )
        {
            xRpRegMap.heartbeat++;
            xRpRegMap.uptime_s = current_second;

            if( default_interface != NULL )
            {
                xRpRegMap.status |= REG_STATUS_CAN_READY;
            }
            else
            {
                xRpRegMap.status &= ( uint16_t ) ~REG_STATUS_CAN_READY;
            }

            if( ( xRpRegMap.control & REG_CTRL_CLEAR_WD_TIMEOUT ) != 0U )
            {
                wd_timeout = 86400;
                xRpRegMap.control &= ( uint16_t ) ~REG_CTRL_CLEAR_WD_TIMEOUT;
            }

            xRpRegMap.i2c_fault_count = xI2cFaultCount;
            xRpRegMap.i2c_recovery_level = xI2cRecoveryLevel;

            xSemaphoreGive( xRegMapMutex );
        }
    }
}

static void prvI2CServiceTask( void *pvParameters )
{
    TickType_t xNextWakeTime;
    TickType_t xLastHeartbeatToggle;
    uint8_t ucLastHeartbeat;

    ( void ) pvParameters;
    xNextWakeTime = xTaskGetTickCount();
    xLastHeartbeatToggle = xNextWakeTime;
    ucLastHeartbeat = prvSampleRpHeartbeat();

    for( ;; )
    {
        TickType_t xNow;
        TickType_t xAge;
        uint8_t ucHeartbeat;

        vTaskDelayUntil( &xNextWakeTime, mainI2C_TASK_FREQUENCY_MS );

        xNow = xTaskGetTickCount();
        ucHeartbeat = prvSampleRpHeartbeat();

        if( ucHeartbeat != ucLastHeartbeat )
        {
            ucLastHeartbeat = ucHeartbeat;
            xLastHeartbeatToggle = xNow;
            xI2cRecoveryLevel = 0;

            if( xSemaphoreTake( xRegMapMutex, pdMS_TO_TICKS( 5 ) ) == pdPASS )
            {
                xRpRegMap.status |= REG_STATUS_I2C_LINK_OK;
                xRpRegMap.status &= ( uint16_t ) ~REG_STATUS_I2C_DEGRADED;
                wdt1_pulse_period_s = xRpRegMap.wdt1_period_s;
                wdt2_pulse_period_s = xRpRegMap.wdt2_period_s;
                xSemaphoreGive( xRegMapMutex );
            }
            continue;
        }

        xAge = xNow - xLastHeartbeatToggle;
        if( xAge < pdMS_TO_TICKS( I2C_FDIR_HEARTBEAT_TIMEOUT_MS ) )
        {
            if( xSemaphoreTake( xRegMapMutex, pdMS_TO_TICKS( 5 ) ) == pdPASS )
            {
                wdt1_pulse_period_s = xRpRegMap.wdt1_period_s;
                wdt2_pulse_period_s = xRpRegMap.wdt2_period_s;
                xSemaphoreGive( xRegMapMutex );
            }
            continue;
        }

        /* Escalation trigger: no observed RP heartbeat edge within timeout window. */
        xI2cFaultCount++;

